{
  "problemas": [
    {
      "texto": "En el parque de atracciones, Marta y sus 3 amigos compraron entradas. Cada entrada de niño cuesta 8 € y cada entrada de adulto 15 €. Pagaron en total 46 € con un billete de 50 € y les devolvieron 4 €. ¿Cuántas entradas de adulto compraron?",
      "opciones": ["0", "1", "2", "3"],
      "correcta": "2"
    },
    {
      "texto": "Una frutería recibió el lunes 48 kg de manzanas, el martes 35 kg y el miércoles 29 kg. El jueves vendieron 56 kg y el viernes 42 kg. ¿Cuántos kilos de manzanas les quedan al final de la semana?",
      "opciones": ["8 kg", "14 kg", "22 kg", "26 kg"],
      "correcta": "14 kg"
    },
    {
      "texto": "Lucía tiene 96 cromos. Regala 18 a su hermano y luego compra 3 paquetes de 12 cromos cada uno. Después intercambia 15 cromos repetidos. ¿Cuántos cromos tiene ahora Lucía?",
      "opciones": ["87", "95", "99", "105"],
      "correcta": "99"
    },
    {
      "texto": "En el cine vendieron el sábado 128 palomitas grandes y 95 pequeñas. Cada palomitas grande cuesta 5 € y cada pequeña 3 €. ¿Cuánto dinero recaudaron en total solo con las palomitas?",
      "opciones": ["875 €", "925 €", "949 €", "1.025 €"],
      "correcta": "925 €"
    },
    {
      "texto": "Un autobús escolar lleva 42 niños. En la primera parada bajan 8 y suben 15. En la segunda parada bajan 11 y suben 9. ¿Cuántos niños hay ahora en el autobús?",
      "opciones": ["39", "42", "47", "51"],
      "correcta": "47"
    },
    {
      "texto": "En la biblioteca hay 8 estanterías con 24 libros cada una. Prestaron 38 libros y luego devolvieron 15. Después compraron 2 cajas con 30 libros cada una. ¿Cuántos libros hay ahora en total en la biblioteca?",
      "opciones": ["192", "211", "229", "237"],
      "correcta": "229"
    },
    {
      "texto": "Pablo vendió 18 entradas de cine a 7 € y 25 entradas a 9 €. Su jefe le dijo que había vendido 450 € en total. ¿Cuánto dinero le falta o le sobra a Pablo?",
      "opciones": ["Le faltan 99 €", "Le sobran 11 €", "Le faltan 24 €", "Está exacto"],
      "correcta": "Le faltan 99 €"
    },
    {
      "texto": "Una granja tiene gallinas y conejos. En total hay 36 cabezas y 100 patas. ¿Cuántas gallinas hay?",
      "opciones": ["28", "26", "22", "20"],
      "correcta": "22"
    },
    {
      "texto": "En una pastelería hacen paquetes de 6 magdalenas. El lunes hicieron 156 magdalenas, el martes 189 y el miércoles 174. ¿Cuántos paquetes completos pudieron hacer en total estos tres días?",
      "opciones": ["79", "83", "85", "86"],
      "correcta": "86"
    },
    {
      "texto": "Sara tenía ahorros y compró un juego de 48 €. Le quedaron 27 €. Luego su abuela le dio el doble de lo que le quedaba y después gastó 36 € en chuches. Ahora tiene 18 €. ¿Cuánto dinero tenía Sara al principio?",
      "opciones": ["63 €", "69 €", "75 €", "81 €"],
      "correcta": "75 €"
    }
  ]
}